web/CI4/app/Helpers/nggaRing_helper.php

SELECT *
FROM `mas_user_token`
WHERE `badge_id` = 'cp-1'
UPDATE `mas_user_token` SET `exp_token` = 1648460978
INSERT INTO `mas_user_token` (`badge_id`, `token_app`, `exp_token`, `exp_time`) VALUES ('cp11', '2y10aFPMMiMft89c4YhmK6e4aVceaa2FFgYBf15kT2pRCJzpzEQtOxK', 1648456163, '0')
SELECT *
FROM `mas_user_token`
WHERE `badge_id` = 'cp11'
---
function getToken($badge_id)
{
    $db = \Config\Database::connect();
    $key = $db->table('mas_user_token')->where(['badge_id' => $badge_id])->get()->getRowArray();
    if ($key) {
        $db->table('mas_user_token')->update(['exp_token' => time()]);
        $data = $db->table('mas_user_token')->where(['badge_id' => $badge_id])->get()->getRowArray();
    } else {
        $data = [
            'badge_id' => $badge_id, //pemilik token
            'token_app' => preg_replace("/[^a-zA-Z0-9]/", "", password_hash(bin2hex(openssl_random_pseudo_bytes(64)), PASSWORD_BCRYPT)), //create token
            'exp_token' => time(), //waktu token di buat
            'exp_time' => "0" // merupakan waktu yang akan di set untuk mengaktifkan token
        ];

        $db->table('mas_user_token')->insert($data);

        $data = $db->table('mas_user_token')->where(['badge_id' => $badge_id])->get()->getRowArray();