web/CI4/app/Models/RestApiModel.php

    public function loginUser($badge_id, $password)
    {
        $data = $this->db->table('mas_user_data')->where(['badge_id' => $badge_id])->get()->getRowArray();
---
SELECT *
FROM `mas_user_data`
WHERE `badge_id` = 'cp-2'

    public function registerUser($data)
    {
        $badge = $this->db->table('mas_user_data')->where(['badge_id' => $data['badge_id']])->get()->getRowArray();
        $email = $this->db->table('mas_user_data')->where(['email' => $data['email']])->get()->getRowArray();
        $nik = $this->db->table('mas_user_data')->where(['nik' => $data['nik']])->get()->getRowArray();
        $number_phone = $this->db->table('mas_user_data')->where(['number_phone' => $data['number_phone']])->get()->getRowArray();

        if ($badge) {
            $data = [
                'stts' => false,
                'msg' => 'badge already registered'
            ];
        } elseif ($email) {
            $data = [
                'stts' => false,
                'msg' => 'email already registered'
            ];
        } elseif ($nik) {
            $data = [
                'stts' => false,
                'msg' => 'nik already registered'
            ];
        } elseif ($number_phone && $data['number_phone']) {
            $data = [
                'stts' => false,
                'msg' => 'number phone already registered'
            ];
        } else {
            $this->db->table('mas_user_data')->insert($data);
---
SELECT *
FROM `mas_user_data`
WHERE `badge_id` = 'cp-1'
SELECT *
FROM `mas_user_data`
WHERE `email` = 'ringga@gmail.com'
SELECT *
FROM `mas_user_data`
WHERE `nik` = '123123'
SELECT *
FROM `mas_user_data`
WHERE `number_phone` = ''
INSERT INTO `mas_user_data` (`badge_id`, `name`, `email`, `password`, `image`, `alamat`, `jabatan`, `nik`, `number_phone`, `created`) VALUES ('cp-1', 'ringga1=', 'ringga@gmail.com', '$2y$10$RJmNff1WSjmzK5U40K.WCeO/yUHJ2r4jAKB8ivw2Zq2tYxvIb7TdC', 'user.jpg', 'jateng', 'it', '123123', '', '2022-Mar-28 04:44:23 AMringga1=')